; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-62)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 - object)
 (:init 
    (arm-empty)
    (clear b13)
    (on b13 b17)
    (on b17 b8)
    (on-table b8)
    (clear b1)
    (on b1 b12)
    (on b12 b11)
    (on b11 b10)
    (on b10 b16)
    (on-table b16)
    (clear b4)
    (on b4 b15)
    (on b15 b7)
    (on b7 b18)
    (on b18 b2)
    (on b2 b14)
    (on b14 b6)
    (on b6 b5)
    (on b5 b9)
    (on b9 b3)
    (on-table b3))
 (:goal (and 
(on b13 b7)
))
)

; plan
1. (unstack b4 b15)
   deleted: (on b4 b15) (clear b4) (arm-empty)
   added: (holding b4) (clear b15)
   goals met: 0 of 1
2. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 1
3. (unstack b15 b7)
   deleted: (on b15 b7) (clear b15) (arm-empty)
   added: (holding b15) (clear b7)
   goals met: 0 of 1
4. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 0 of 1
5. (unstack b13 b17)
   deleted: (on b13 b17) (clear b13) (arm-empty)
   added: (holding b13) (clear b17)
   goals met: 0 of 1
6. (stack b13 b7)
   deleted: (clear b7) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b7)
   goals met: 1 of 1
